{  
   "modelTopology":{  
      "training_config":{  
         "metrics":[  
            "accuracy"
         ],
         "loss":"binary_crossentropy",
         "optimizer_config":{  
            "class_name":"Adam",
            "config":{  
               "beta_1":0.8999999761581421,
               "beta_2":0.9990000128746033,
               "decay":0.0,
               "epsilon":1e-07,
               "amsgrad":false,
               "lr":0.0010000000474974513
            }
         },
         "loss_weights":null,
         "sample_weight_mode":null
      },
      "keras_version":"2.2.2",
      "model_config":{  
         "class_name":"Sequential",
         "config":[  
            {  
               "class_name":"Embedding",
               "config":{  
                  "embeddings_initializer":{  
                     "class_name":"RandomUniform",
                     "config":{  
                        "maxval":0.05,
                        "seed":null,
                        "minval":-0.05
                     }
                  },
                  "name":"embedding_1",
                  "dtype":"float32",
                  "output_dim":300,
                  "trainable":false,
                  "embeddings_regularizer":null,
                  "input_dim":75097,
                  "mask_zero":false,
                  "embeddings_constraint":null,
                  "batch_input_shape":[  
                     null,
                     30
                  ],
                  "activity_regularizer":null,
                  "input_length":30
               }
            },
            {  
               "class_name":"LSTM",
               "config":{  
                  "recurrent_activation":"hard_sigmoid",
                  "trainable":true,
                  "recurrent_initializer":{  
                     "class_name":"Orthogonal",
                     "config":{  
                        "seed":null,
                        "gain":1.0
                     }
                  },
                  "use_bias":true,
                  "bias_regularizer":null,
                  "return_state":false,
                  "unroll":false,
                  "bias_initializer":{  
                     "class_name":"Zeros",
                     "config":{  

                     }
                  },
                  "units":128,
                  "unit_forget_bias":true,
                  "activity_regularizer":null,
                  "recurrent_dropout":0.0,
                  "kernel_initializer":{  
                     "class_name":"VarianceScaling",
                     "config":{  
                        "distribution":"uniform",
                        "scale":1.0,
                        "seed":null,
                        "mode":"fan_avg"
                     }
                  },
                  "kernel_constraint":null,
                  "activation":"tanh",
                  "stateful":false,
                  "dropout":0.0,
                  "recurrent_regularizer":null,
                  "name":"lstm_1",
                  "bias_constraint":null,
                  "go_backwards":false,
                  "implementation":1,
                  "kernel_regularizer":null,
                  "return_sequences":false,
                  "recurrent_constraint":null
               }
            },
            {  
               "class_name":"Dense",
               "config":{  
                  "kernel_initializer":{  
                     "class_name":"VarianceScaling",
                     "config":{  
                        "distribution":"uniform",
                        "scale":1.0,
                        "seed":null,
                        "mode":"fan_avg"
                     }
                  },
                  "name":"dense_1",
                  "bias_regularizer":null,
                  "bias_constraint":null,
                  "activation":"sigmoid",
                  "trainable":true,
                  "kernel_constraint":null,
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "class_name":"Zeros",
                     "config":{  

                     }
                  },
                  "units":1,
                  "use_bias":true,
                  "activity_regularizer":null
               }
            }
         ]
      },
      "backend":"tensorflow"
   },
   "weightsManifest":[  
      {  
         "paths":[  
            "group1-shard1of22",
            "group1-shard2of22",
            "group1-shard3of22",
            "group1-shard4of22",
            "group1-shard5of22",
            "group1-shard6of22",
            "group1-shard7of22",
            "group1-shard8of22",
            "group1-shard9of22",
            "group1-shard10of22",
            "group1-shard11of22",
            "group1-shard12of22",
            "group1-shard13of22",
            "group1-shard14of22",
            "group1-shard15of22",
            "group1-shard16of22",
            "group1-shard17of22",
            "group1-shard18of22",
            "group1-shard19of22",
            "group1-shard20of22",
            "group1-shard21of22",
            "group1-shard22of22"
         ],
         "weights":[  
            {  
               "dtype":"float32",
               "shape":[  
                  128,
                  1
               ],
               "name":"dense_1/kernel"
            },
            {  
               "dtype":"float32",
               "shape":[  
                  1
               ],
               "name":"dense_1/bias"
            },
            {  
               "dtype":"float32",
               "shape":[  
                  75097,
                  300
               ],
               "name":"embedding_1/embeddings"
            },
            {  
               "dtype":"float32",
               "shape":[  
                  300,
                  512
               ],
               "name":"lstm_1/kernel"
            },
            {  
               "dtype":"float32",
               "shape":[  
                  128,
                  512
               ],
               "name":"lstm_1/recurrent_kernel"
            },
            {  
               "dtype":"float32",
               "shape":[  
                  512
               ],
               "name":"lstm_1/bias"
            }
         ]
      }
   ]
}